#!/usr/bin/env python3
"""
Подробное руководство по ручной авторизации в Kiro
"""

import sys
import webbrowser
from urllib.parse import urlparse, parse_qs

def print_header():
    print("🔐 РУКОВОДСТВО ПО РУЧНОЙ АВТОРИЗАЦИИ KIRO")
    print("=" * 60)
    print()

def print_step(step_num, title, description):
    print(f"📋 ШАГ {step_num}: {title}")
    print("-" * 40)
    print(description)
    print()

def main():
    print_header()
    
    print_step(1, "ЗАПУСК АВТОРИЗАЦИИ В МЕНЕДЖЕРЕ", 
        """1. Откройте DroidGravity Manager
2. Нажмите кнопку 'Add Account'
3. Выберите вкладку 'OAuth'
4. Нажмите 'Start OAuth' - откроется браузер
5. Авторизуйтесь через Google аккаунт""")
    
    print_step(2, "ОТКРЫТИЕ DEVTOOLS В БРАУЗЕРЕ",
        """1. После авторизации откройте DevTools (F12)
2. Перейдите на вкладку 'Network' (Сеть)
3. Включите запись сетевого трафика (кнопка записи)
4. Обновите страницу или повторите авторизацию""")
    
    print_step(3, "ПОИСК ТОКЕНОВ В NETWORK TAB",
        """Найдите один из этих запросов:
• 'GetToken' - содержит accessToken и refreshToken
• 'token' - может содержать токены
• Запросы к 'app.kiro.dev/api/v1/GetToken'

В ответе (Response) найдите:
• "accessToken": "aoaAAAAAGmV..."
• "refreshToken": "aorAAAAAGoM..."
• "profileArn": "arn:aws:codewhisperer:..."
• "expiresIn": 3600""")
    
    print_step(4, "АЛЬТЕРНАТИВНЫЙ СПОСОБ - LOCAL STORAGE",
        """1. В DevTools перейдите на вкладку 'Application'
2. В левой панели найдите 'Local Storage'
3. Выберите 'https://app.kiro.dev'
4. Найдите ключи с токенами:
   • kiro_access_token
   • kiro_refresh_token
   • kiro_profile_arn""")
    
    print_step(5, "ВВОД ТОКЕНОВ В МЕНЕДЖЕР",
        """1. Вернитесь в DroidGravity Manager
2. Перейдите на вкладку 'Token'
3. Вставьте найденные токены:
   • Access Token: aoaAAAAAGmV...
   • Refresh Token: aorAAAAAGoM...
4. Нажмите 'Add Account'""")
    
    print("🎯 ВАЖНЫЕ МОМЕНТЫ:")
    print("-" * 20)
    print("• Токены очень длинные (200+ символов)")
    print("• Access Token начинается с 'aoaAAAAA'")
    print("• Refresh Token начинается с 'aorAAAAA'")
    print("• Profile ARN содержит 'codewhisperer'")
    print("• Токены действительны 1 час (3600 секунд)")
    print()
    
    print("🔧 ОТЛАДКА:")
    print("-" * 10)
    print("• Если не видите запросов - обновите страницу")
    print("• Если токенов нет в Local Storage - повторите авторизацию")
    print("• Если ошибка 'invalid_client_secret' - это нормально, ищите токены в DevTools")
    print()
    
    print("✅ УСПЕХ!")
    print("-" * 10)
    print("После добавления аккаунта вы сможете:")
    print("• Использовать все модели Kiro (Claude, DeepSeek, Minimax, Qwen)")
    print("• Настроить индивидуальные прокси для каждого аккаунта")
    print("• Ротировать между несколькими Kiro аккаунтами")
    print()

if __name__ == "__main__":
    main()